// Двумерные массивы и рекурсия

// int[,] matrix = new int[5,8]; // запятая в квадратных скобках
// это показатель двумерности. 5 - количество строк, 8 - количество столбцов 
// в массиве

//string[,] table = new string[2, 5];
// table[0,0] table[0,1] table[0,2] table[0,3] table[0,4]  // 0 - индекс элемента в строке;
// 0 1 2 3 4 - индекс элемента в столбце. Индексы идут с 0.
// table[0,0] table[1,0]   // 2 строки 
// String.Empty - инициализация строк


//table[1, 2] = " слово ";

//for (int rows = 0; rows < 2; rows++) // Строки 
//{
//    for (int columns = 0; columns < 5; columns++)  // Столбцы
//    {
//Console.WriteLine($"-{table[rows, columns]}-");  
//   }
//}

// С цифрами:

//int[,] matrix = new int[3, 4];

//for (int rows = 0; rows < 3; rows++)
//{
// for (int columns = 0; columns < 4; columns++)
//  {
//      Console.Write($"{matrix[rows, columns]} "); // пробел после фигурных скобок
//  }
//  Console.WriteLine(); // Добавляем перенос на новую строку для удобства
// }

// Вариант с изменениями:

// rows это i , а columns это j

// новый параметр GetLength() : GetLength(0) обозначает строки - это вместо 3 в цикле for

// GetLength(1) обозначает столбцы - это вместо 4 в цикле for

// int[,] matrix = new int[3, 4];

//for (int i = 0; i < matrix.GetLength(0); i++)
//{
//   for (int j = 0; j < matrix.GetLength(1); j++)
//   {
//       Console.Write($"{matrix[i, j]} "); 
//   }
//   Console.WriteLine(); 
//}

//Теперь напишем метод для распечатывания такого массива и заполнения его числами:



//  void PrintArray(int[,] matr)                    // Метод распечатывания массива
// {                                                //
//                                                  //
//  for (int i = 0; i < matr.GetLength(0); i++)     //
//  {                                               //
//    for (int j = 0; j < matr.GetLength(1); j++)   //
//     {                                            //
//        Console.Write($"{matr[i, j]} ");          //
//     }                                            //
//     Console.WriteLine();                         //
//  }                                               //
//                                                  //
// }                                                //

// //-------------------------------------------------------------------------------------------------------

// void FillArray(int[,] matr)                          //
// {                                                    // Метод заполнения массива 
//                                                      // случайными числами
//     for (int i = 0; i < matr.GetLength(0); i++)      //
//     {                                                //
//         for (int j = 0; j < matr.GetLength(1); j++)  //
//         {                                            //
//             matr[i,j] = new Random().Next(1,10);       //
//         }                                            //
//     }                                                //
// }                                                    //

//----------------------------------------------------------------------------------------------------------------------

// int[,] matrix = new int[3, 4];

// PrintArray(matrix);
// FillArray(matrix);
// Console.WriteLine();
// PrintArray(matrix);

//-----------------------------------------------------------------

// Раскрашивание массива (палец вверх):
//------------------------------------------

// int[,] pic = new int[,]
// {
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0 },
// {0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// };


// void PrintImage(int[,] image)                    // Метод распечатывания массива
// {                                                //
//                                                   //
//  for (int i = 0; i < image.GetLength(0); i++)     //
//   {                                               //
//     for (int j = 0; j < image.GetLength(1); j++)   //
//      {                                            //
// //       Console.Write($"{matr[i, j]} ");
//          if (image[i,j] == 0) Console.Write($" ");  // Если элемент совпадет с 0 ,
//          else Console.WriteLine($"+");              // то в этом месте ставится пробел ($" ") - те область не закрашивается
//         }                                            // Если с единицей - ставится +
//      Console.WriteLine();                         //
//   }                                               //
//                                                   //
//  }

//PrintImage(pic); // В консоли вырисовывается палец вверх

//---------------------------------------------

// Метод закрашивания внутри пальца
//------------------------------------

// void FillImage(int row, int col)      // Метод закрашивания внутренней области
// {                                    
//   if (pic[row,col] == 0)             // Если элемент с координатами row и col равен 0 (не закрашен),
//   {                                  
//         pic[row, col] = 1;           //  то закрашиваем его единичкой (1)
//         FillImage(row - 1, col);     // Далее метод FillImage вызывает сам себя с аргументами
//         FillImage(row, col - 1);     // передвижения по точкам: вверх,влево,вниз,вправо
//         FillImage(row + 1, col);
//         FillImage(row, col + 1);
//     }
// }

// PrintImage(pic);
// FillImage(13, 13);
// PrintImage(pic);

//-----------------------------------------------------------

// Рекурсия - это когда метод вызывает сам себя 

// Метод вычисления факториала:

//Стихийный способ:

// int Factorial (int n)
// {
//   // 1! = 1
//   // 0! = 1
//   if (n == 1) return 1;
//   else return n * Factorial (n-1);
// }

// Console.WriteLine(Factorial(5)); // 1*2*3 = 6

//С методами:

//// int Factorial(int n)
// double Factorial(double n)
// {
//  // 1! = 1
//  // 0! = 1
//  if(n == 1) return 1;
//  else return n * Factorial(n-1);
// }
// for (int i = 1; i < 40; i++)
// {
//  Console.WriteLine($"{i}! = {Factorial(i)}");
// }
//Очистим и запустим терминал. Всё хорошо до 17!. Это происходит из за
// переполнения типа данных - int. Поменяем на double - уже лучше.

// Числа Фибоначчи:

// f(1) = 1
// f(2) = 1
// f(n) = f(n-1) + f(n-2)

double Fibonacci(double n)

{
    if (n == 1 || n == 2) return 1;
    else return Fibonacci(n - 1) + Fibonacci(n - 2);
}

for (int i = 1; i < 50; i++) // До десяти
{
   Console.WriteLine(Fibonacci(i));
}
// Заменим int на double
 